# Выведите на экран "I'm done!" 
print("I'm done")