# Написать программу, которая находит все простые числа в заданном 
# интервале методом "Решето Эратосфена". 
# start и finish - границы диапазона (включительно).

import math

def sieve(start, finish):
  primes = []
  return primes

print(sieve(10, 20))
